import React from 'react'
import {Text} from 'react-native'
import styles from '../../pages/style'

const Privacy = () => {
  return (
    <>
      <Text style={[styles.mb1]}>
        Политика конфиденциальности персональных данных (далее — Политика)
        действует в отношении всей информации, которую Разработчик может
        получить о Пользователе во время использования им Приложения, а также в
        ходе исполнения Разработчиком любых соглашений и договоров с
        Пользователем.
      </Text>

      <Text style={[styles.fw600, styles.mb1]}>1. ОБЩИЕ ПОЛОЖЕНИЯ</Text>

      <Text style={[styles.mb1]}>
        1.1. Разработчик обрабатывает персональные данные на законной и
        справедливой основе для выполнения возложенных на Разработчика
        законодательством функций, полномочий и обязанностей, осуществления прав
        и законных интересов Разработчика и Пользователей.
      </Text>

      <Text style={[styles.mb1]}>
        1.2. Использование Приложения, а также его отдельных функций означает
        безоговорочное согласие Пользователя с настоящей Политикой и указанными
        в ней условиями обработки его персональных данных; в случае несогласия с
        этими условиями Пользователь должен воздержаться от использования
        Приложения.
      </Text>

      <Text style={[styles.fw600, styles.mb1]}>
        2. ОБРАБОТКА И КОНФИДЕНЦИАЛЬНОСТЬ ПЕРСОНАЛЬНЫХ ДАННЫХ ПОЛЬЗОВАТЕЛЯ
      </Text>

      <Text style={[styles.mb1]}>
        2.1. Настоящая Политика устанавливает обязательства Разработчика по
        неразглашению и обеспечению режима защиты конфиденциальности
        персональных данных, которые Пользователь предоставляет при
        использовании Приложения.
      </Text>

      <Text style={[styles.mb1]}>
        2.2. Категории персональных данных, которые Разработчик может собирать с
        Пользователей для предоставления доступа к функциям Приложения:
      </Text>

      <Text style={[styles.mb1]}>
        - Персональная информация, которую пользователь предоставляет о себе
        самостоятельно при регистрации (создании учётной записи), подключении
        аккаунтов социальных сетей, а также в процессе использования Приложения,
        включая персональные данные пользователя. Иная информация
        предоставляется пользователем на его усмотрение.
      </Text>

      <Text style={[styles.mb1]}>
        - Данные пользовательского аккаунта в социальных сетях (ФИО, E-mail,
        фото)
      </Text>

      <Text style={[styles.mb1]}>
        - Данные, которые пользователь загружает в Приложение в процессе его
        использования (Например: Изображения; Фото\видео материалы; свои
        физические параметры)
      </Text>

      <Text style={[styles.mb1]}>
        2.3. Разработчик защищает данные, которые автоматически передаются в
        процессе просмотра рекламных блоков и при посещении страниц Приложения,
        на которых установлен статистический скрипт системы ("пиксель").
      </Text>

      <Text style={[styles.mb1]}>
        2.4. Настоящая Политика применима только к информации, обрабатываемой в
        ходе использования Приложения. Разработчик не контролирует и не несет
        ответственность за обработку информации Сервисами и Сервисами третьих
        лиц, на которые Пользователь может перейти по ссылкам, доступным внутри
        Приложения.
      </Text>

      <Text style={[styles.mb1]}>
        2.5. Разработчик не проверяет достоверность персональных данных,
        предоставляемых Пользователем, и не имеет возможности оценивать его
        дееспособность. Однако Разработчик исходит из того, что пользователь
        предоставляет достоверные и достаточные персональные данные и
        поддерживает их в актуальном состоянии. Последствия предоставления
        недостоверной или недостаточной информации определены в Соглашении.
      </Text>

      <Text style={[styles.fw600, styles.mb1]}>
        3. ЦЕЛИ СБОРА ПЕРСОНАЛЬНЫХ ДАННЫХ ПОЛЬЗОВАТЕЛЯ
      </Text>

      <Text style={[styles.mb1]}>
        3.1. Разработчик собирает и хранит только те персональные данные,
        которые необходимы для предоставления полного или частичного функционала
        Приложения или исполнения соглашений и договоров с Пользователем, за
        исключением случаев, когда законодательством предусмотрено обязательное
        хранение персональных данных в течение определенного законом срока.
      </Text>

      <Text style={[styles.mb1]}>
        3.2. Разработчик обрабатывает персональные данные Пользователя в
        следующих целях:
      </Text>

      <Text style={[styles.mb1]}>
        - Идентификация стороны в рамках соглашений и договоров с Разработчиком;
      </Text>

      <Text style={[styles.mb1]}>
        - Связь с пользователем, в том числе направление уведомлений, запросов и
        информации, касающихся использования Приложения, оказания услуг, а также
        обработка запросов и заявок от пользователя;
      </Text>

      <Text style={[styles.mb1]}>
        - Предоставление пользователю персонализированных услуг;
      </Text>

      <Text style={[styles.mb1]}>
        - Улучшение качества Приложения, удобства его использования;
      </Text>

      <Text style={[styles.mb1]}>
        - Проведение статистических и иных исследований на основе обезличенных
        данных.
      </Text>

      <Text style={[styles.fw600, styles.mb1]}>
        4. УСЛОВИЯ ОБРАБОТКИ ПЕРСОНАЛЬНЫХ ДАННЫХ ПОЛЬЗОВАТЕЛЕЙ
      </Text>

      <Text style={[styles.mb1]}>
        4.1. Обработка персональных данных Пользователя осуществляется без
        ограничения срока, любым законным способом, в том числе в информационных
        системах персональных данных с использованием средств автоматизации или
        без использования таких средств.
      </Text>

      <Text style={[styles.mb1]}>
        4.2. В отношении персональных данных Пользователя сохраняется их
        конфиденциальность, кроме случаев добровольного предоставления
        Пользователем информации о себе для общего доступа неограниченному кругу
        лиц. При использовании отдельных функций Приложения, Пользователь
        соглашается с тем, что определённая часть его персональной информации
        становится общедоступной.
      </Text>

      <Text style={[styles.mb1]}>
        4.3. При обработке персональных данных Пользователей Разработчик
        руководствуется:
      </Text>

      <Text style={[styles.mb1]}>
        4.3.1. Федеральным законом от 27.07.2006 г. № 152-ФЗ «О персональных
        данных»;
      </Text>

      <Text style={[styles.mb1]}>
        4.3.2. Постановлением Правительства Российской Федерации от 01.11.2012
        г. № 1119 «Об утверждении требований к защите персональных данных при их
        обработке в информационных системах персональных данных»;
      </Text>

      <Text style={[styles.mb1]}>
        4.3.3. Постановлением Правительства Российской Федерации от 15.09.2008
        г. № 687 «Об утверждении Положением об особенностях обработки
        персональных данных, осуществляемой без использования средств
        автоматизации»;
      </Text>

      <Text style={[styles.mb1]}>
        4.3.4. Приказом ФСТЭК России от 18 февраля 2013 г. № 21 «Об утверждении
        Состава и содержания организационных и технических мер по обеспечению
        безопасности персональных данных при их обработке в информационных
        системах персональных данных»;
      </Text>

      <Text style={[styles.mb1]}>
        4.3.5. Приказом ФСБ России от 10.07.2014 № 378 «Об утверждении Состава и
        содержания организационных и технических мер по обеспечению безопасности
        персональных данных при их обработке в информационных системах
        персональных данных с использованием средств криптографической защиты
        информации, необходимых для выполнения установленных Правительством
        Российской Федерации требований к защите персональных данных для каждого
        из уровней защищенности».
      </Text>

      <Text style={[styles.mb1]}>
        4.4. Разработчик вправе передать персональные данные Пользователя
        третьим лицам в следующих случаях:
      </Text>

      <Text style={[styles.mb1]}>
        - Пользователь выразил свое согласие на такие действия;
      </Text>

      <Text style={[styles.mb1]}>
        - Передача необходима в рамках использования Приложения
      </Text>

      <Text style={[styles.mb1]}>
        - Передача предусмотрена российским или иным применимым
        законодательством в рамках установленной законодательством процедуры.
      </Text>

      <Text style={[styles.fw600, styles.mb1]}>
        5. ИЗМЕНЕНИЕ И УДАЛЕНИЕ ПЕРСОНАЛЬНЫХ ДАННЫХ. ОБЯЗАТЕЛЬНОЕ ХРАНЕНИЕ
        ДАННЫХ
      </Text>

      <Text style={[styles.mb1]}>
        5.1. Пользователь может в любой момент изменить (обновить, дополнить)
        предоставленные им персональные данные или их часть, обратившись в
        службу поддержки
      </Text>

      <Text style={[styles.fw600, styles.mb1]}>
        6. МЕРЫ, ПРИМЕНЯЕМЫЕ ДЛЯ ЗАЩИТЫ ПЕРСОНАЛЬНЫХ ДАННЫХ ПОЛЬЗОВАТЕЛЯ
      </Text>

      <Text style={[styles.mb4]}>
        6.1. Разработчик принимает необходимые и достаточные организационные и
        технические меры для защиты персональных данных Пользователя от
        неправомерного или случайного доступа, уничтожения, изменения,
        блокирования, копирования, распространения, а также от иных
        неправомерных действий с ней третьих лиц.
      </Text>
    </>
  )
}

export default Privacy
