import React from 'react'
import {Text} from 'react-native'
import styles from '../../pages/style'

const Rules = () => {
  return (
    <>
      <Text style={[styles.fw600, styles.mb1]}>1. Введение</Text>

      <Text style={[styles.mb1]}>
        FitQuest предлагает программное обеспечение для здорового образа жизни,
        развития физической формы, силы воли и уверенности в себе. Мы
        сопровождаем наших пользователей на их пути к здоровому образу жизни.
        Перед началом использования приложения FitQuest важно ознакомиться с
        Правилами сервиса. Использование приложения означает, что вы
        соглашаетесь с этими Правилами.
      </Text>
      <Text style={[styles.mb1]}>
        Правила могут быть изменены. Если вы не согласны с настоящими Правилами,
        пожалуйста, не используйте приложение.
      </Text>

      <Text style={[styles.fw600, styles.mb1]}>2. Предмет</Text>

      <Text style={[styles.mb1]}>
        Создать учетную запись и начать пользоваться приложением FitQuest могут
        только полностью дееспособные пользователи в возрасте старше 18 лет.
        Приложение FitQuest предназначено исключительно для использования
        конечными потребителями. С юридической точки зрения конечным
        потребителем является любое физическое лицо, которое вступает в законную
        сделку по причинам, не связанным с его коммерческой или
        предпринимательской деятельностью. Использование FitQuest в любых
        коммерческих целях категорически запрещено.
      </Text>
      <Text style={[styles.mb1]}>
        Мы оставляем за собой право изменять Правила в любое время без
        предварительного уведомления. Рекомендуем рассмотреть эти Правила каждый
        раз, когда вы используете приложение. Использование приложения после
        любой такой поправки в Правилах означает ваше согласие с новой версией
        правил.
      </Text>

      <Text style={[styles.fw600, styles.mb1]}>
        3. Услуги FitQuest и цены на них
      </Text>
      <Text style={[styles.mb1]}>
        Спектр услуг, включенных в FitQuest и доступных вам для использования,
        зависит от вида Услуг FitQuest и от того, платите ли вы за их
        использование. Если вы используете FitQuest бесплатно, у вас имеется
        доступ лишь к определенным базовым функциям и информации соответствующей
        Услуги FitQuest. Более широкий набор функций будет доступен вам, если вы
        активируете соответствующие модули контента (например, план тренировок)
        отдельно за разовый платеж или в составе подписки на соответствующую
        услугу FitQuest. Обращаем ваше внимание на то, что для использования
        некоторых услуг FitQuest в полной мере, вам может потребоваться
        определенное оборудование и инструменты (например, спортивный тренажер,
        гантели или турник). Их предоставление не входит в объем Услуг FitQuest.
        Вам необходимо будет приобрести их отдельно за свой счет.
      </Text>

      <Text style={[styles.fw600, styles.mb1]}>4. Ваше здоровье</Text>

      <Text style={[styles.mb1]}>
        Вы принимаете на себя весь риск, связанный с использованием FitQuest. В
        любом случае, одним из условий использования FitQuest является хорошее
        общее состояние здоровья. Если вам известно о каких-либо имеющихся
        заболеваниях, мы настоятельно рекомендуем вам проконсультироваться с
        врачом до начала использования FitQuest. Соблюдение данной рекомендации
        особенно важно, если вам известно о наличии одного или нескольких из
        перечисленных ниже заболеваний/состояний:
      </Text>
      <>
        <Text style={[styles.mb1]}>– сердечно-сосудистые заболевания,</Text>
        <Text style={[styles.mb1]}>
          - заболевания легких и респираторной системы (включая астму),
        </Text>
        <Text style={[styles.mb1]}>
          - проблемы с позвоночником и/или суставами,
        </Text>
        <Text style={[styles.mb1]}>- нервно-мышечные заболевания,</Text>
        <Text style={[styles.mb1]}>- хирургические операции,</Text>
        <Text style={[styles.mb1]}>- любые другие проблемы со здоровьем.</Text>
      </>

      <Text style={[styles.mb1]}>
        Женщины-атлеты должны иметь в виду, что беременность и кормление
        являются противопоказаниями для физических нагрузок, предлагаемых
        FitQuest.
      </Text>

      <Text style={[styles.mb1]}>
        Следуйте предложенным ниже общим правилам: Слушайте свое тело. Если
        перед первым использованием FitQuest или в процессе использования
        FitQuest у вас возникают какие бы то ни было сомнения, касающиеся вашего
        здоровья (например, в связи с тем, что вы испытываете значительную боль,
        общее общее недомогание, трудности при дыхании, тошноту или
        головокружение), проконсультируйтесь с врачом прежде, чем начать или
        продолжить использовать FitQuest.
      </Text>

      <Text style={[styles.mb1]}>
        Информация, предлагаемая FitQuest, не являются медицинской консультацией
        или консультацией врача. Она также не заменяют собой медицинское
        лечение, назначаемое врачом.
      </Text>

      <Text style={[styles.mb1]}>
        В основе рекомендаций по тренировкам лежат постоянно обновляющиеся
        научные знания о здоровье, питании и занятиях спортом. Несмотря на то,
        что наши советы по тренировкам и питанию разрабатываются с
        использованием текущих исследований и информации, мы не гарантируем, что
        они отражают самые свежие результаты исследований и последние сведения.
      </Text>

      <Text style={[styles.fw600, styles.mb1]}>
        5. Учетная запись пользователя
      </Text>

      <Text style={[styles.mb1]}>
        Заключение пользовательского договора определяется правилами магазина
        приложений Apple. Договор считается заключенным после того, как вы
        нажмете на кнопку "Загрузить" в магазине приложений и, при
        необходимости, введете пароль, обеспечивающий вам доступ в AppStore.
      </Text>
      <Text style={[styles.mb1]}>
        Для использования FitQuest вам необходимо создать бесплатную учетную
        запись. В процессе регистрации мы попросим вас принять настоящие правила
        предоставления услуг и нашу политику конфиденциальности. Вы можете войти
        в систему через свою учетную запись Facebook, Google или Apple. В этом
        случае процесс входа в систему завершится после того, как вы введете
        данные соответствующей учетной записи и нажмете на кнопку «Подтвердить».
      </Text>

      <Text style={[styles.fw600, styles.mb1]}>6. Срок действия</Text>

      <Text style={[styles.mb1]}>
        Пользовательский договор, заключенный между вами и нами после
        регистрации вашей учетной записи, действует в течение неопределенного
        периода времени.
      </Text>

      <Text style={[styles.mb1]}>
        Отдельные дополнительные услуги могут предлагаться в течение
        ограниченного периода времени. По окончании этого срока они
        автоматически перестают предоставляться, дополнительная отмена не
        требуется.
      </Text>

      <Text style={[styles.mb1]}>
        У предлагаемых нами подписок разный минимальный срок действия. Они
        автоматически продлеваются на выбранный минимальный срок до отмены вами
        или нами. Во избежание непониманий, обращаем ваше внимание на то, что
        срок действия подписки определяется по календарю и не зависит от того,
        насколько активно вы пользуетесь соответствующей Услугой FitQuest.
      </Text>

      <Text style={[styles.fw600, styles.mb1]}>
        7. Ответственность
      </Text>

      <Text style={[styles.mb1]}>
        Мы не предоставляем никаких гарантий в отношении того, что использование
        FitQuest принесет ожидаемые вами тренировочные или иные результаты. Мы
        не обещаем, что вам удастся достичь успеха, выраженного в конкретных
        показателях. Кроме того, фактические результаты тренировок зависят от
        факторов, на которые невозможно повлиять, например, таких как исходные
        физические данные и прочие условия. Следовательно, результаты разных
        людей могут значительно отличаться, несмотря на то, что они используют
        одни и те же программы тренировок.
      </Text>

      <Text style={[styles.fw600, styles.mb1]}>
        8. Права на использование контента FitQuest
      </Text>

      <Text style={[styles.mb1]}>
        В зависимости от того, какие услуги вам были подключены или какие услуги
        вы приобрели, предлагаемые нами услуги содержат контент, защищенный
        авторским правом или иными законами, а мы являемся обладателями
        соответствующих прав. Мы предоставляем вам неэксклюзивное и
        непередаваемое право на использование указанного контента в
        некоммерческих целях в соответствии с положениями договора.
        Исключительно во избежание каких-либо сомнений мы просим вас обратить
        внимание на тот факт, что распространение нашего контента или
        выкладывание его в открытый доступ, например, на сайтах, не являющихся
        сайтами FitQuest, запрещено. После отключения доступа к той или иной
        услуге (например, после отмены вами подписки на нее) или после окончания
        действия вашего пользовательского договора вы теряете право на
        использование контента.
      </Text>

      <Text style={[styles.fw600, styles.mb1]}>9. Контакты</Text>

      <Text style={[styles.mb1]}>
        Свои вопросы вы можете направить по адресу support@fitquest.ru.
      </Text>
    </>
  )
}

export default Rules
